works/soap_service/soap/connect.xml

<?xml version='1.0' ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:CCNS="http://www.capeclear.com/attributes/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <SOAP-ENV:Body>
    <ns1:connect xmlns:ns1="urn:Service" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <usage xsi:type="xsd:string">TestNetTool</usage>
      <login xsi:type="xsd:string">guest</login>
      <pass xsi:type="xsd:string"></pass>
    </ns1:connect>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

